Revit 2024 API
MEPNetworkSegmentData.PressureDrop Property
 The calculated pressure drop of this segment, in kg/(ft*s^2).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public double PressureDrop { get; }
Visual Basic
Public ReadOnly Property PressureDrop As Double
	Get
Visual C++
public:
property double PressureDrop {
	double get ();
}
See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace